# SiteLocation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..SiteLocation Property
Document Class See Also
---
Returns the site location information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SiteLocation SiteLocation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SiteLocation As SiteLocation
	Get
```

Visual C++
---
```text
public:
property SiteLocation^ SiteLocation {
	SiteLocation^ get ();
}
```

# Remarks
The SiteLocation property returns an object that contains the site location for the entire project.
# See Also
Document Class
Autodesk.Revit.DB Namespace